rottenpotatoes/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]

  def search_with_same_director
    @current_movie = Movie.find(params[:id])

    begin
      @movies = Movie.find_with_same_director(@current_movie)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]